ryousato/LPC11U35_CTswitch_relay/main.cpp
            while(1){ //ループ2
                serial.printf("\r\n Type 'C' for Coarse or 'F' for Fine. ('q' quit, 'b' back)\r\n");
                    while(1){ //CorF setting
                        if(serial.readable()) {    // 受信確認
                            moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                            serial.printf("%c", moji[count]);   //シリアル出力表示
    
                            if(count == 2 ){                // ①文字数が既定の個数になった場合
                                moji[2] = '\0';                 // 末尾に終端文字を入れる
                                serial.printf("\r\n\r\n ERROR!\r\n");
                               count = 0;                       // 文字カウンタをリセット
                            }

                            else if(moji[0] == '\n'){count = 0;}
    
                            else if((moji[count] == '\r')) {       // ②CRを受信した場合
                                moji[count] = '\0';                                         //末尾に終端文字を入れる
                                count = 0;                                                  //文字カウンタをリセット
                                if     (strcmp(moji, "C") == 0){
                                    CorF = 2;                                               //粗調整
                                    serial.printf("\r\n---Coarse Setting---");    
                                    break;}
                                else if(strcmp(moji, "F") == 0){
                                    CorF = 1;                                               //微調整        
                                    serial.printf("\r\n---Fine Setting---");    
                                    break;}
                                else if(strcmp(moji,"b")==0 || strcmp(moji,"q")==0){break;}
                                else serial.printf("\r\n\r\n NG!\r\n");
                            }
                            else count++;        // 文字カウンタに1加算
                        } 
                    }//CorF setting
            
                    if(strcmp(moji,"b")==0){
                        serial.printf("\r\n return\r\n");
                        break;     //ループ2ブレイク
                    }
                    else if(strcmp(moji,"q")==0){break;}   //ループ2ブレイク
                    
                while(1){ //ループ3
                    if(adjmode == 1){
                        serial.printf("\r\n Type '+' for increment, '-' for decrement. ('q' quit, 'b' back)");
                        while(1){ //+-モード
                                if(serial.readable()) {    // 受信確認
                                    moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                                    serial.printf("\r\n%c", moji[count]);   //シリアル出力表示
                                    moji[1] = '\0';                                         //末尾に終端文字を入れる
                                    count = 0;                                                  //文字カウンタをリセット

                                    if(strcmp(moji,"b")==0 || strcmp(moji,"q")==0){break;}
                                    else if(strcmp(moji,"\n") == 0){}
                                    else if(strcmp(moji,"+") == 0){incdec(1,1,CorF,mode);}
                                    else if(strcmp(moji,"-") == 0){incdec(0,1,CorF,mode);}
                                    else serial.printf("\r\n\r\n NG!\r\n");
                                }
                        } //+-モード
                        if(strcmp(moji,"b")==0){
                            serial.printf("\r\n return\r\n");
                            break;     //ループ3ブレイク
                        }
                        else if(strcmp(moji,"q")==0){break;}   //ループ3ブレイク
                        }                                            
                    else if(adjmode == 2){
                      while(1){ //ループ4
                        serial.printf("\r\n Type '+' for increase, '-' for decrease. ('q' quit, 'b' back)");
                        while(1){ //numモード
                                if(serial.readable()) {    // 受信確認
                                    moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                                    serial.printf("%c", moji[count]);   //シリアル出力表示
    
                                    if(count == 2 ){                // ①文字数が既定の個数になった場合
                                        moji[2] = '\0';                 // 末尾に終端文字を入れる
                                        serial.printf("\r\n\r\n ERROR!\r\n");
                                       count = 0;                       // 文字カウンタをリセット
                                    }

                                    else if(moji[0] == '\n'){count = 0;}
    
                                    else if((moji[count] == '\r')) {       // ②CRを受信した場合
                                        moji[count] = '\0';                                         //末尾に終端文字を入れる
                                        count = 0;                                                  //文字カウンタをリセット
                                        if     (strcmp(moji, "+") == 0){
                                            incr = 1;                                               //増加
                                            serial.printf("\r\n---increase---");    
                                            break;}
                                        else if(strcmp(moji, "-") == 0){
                                            incr = 0;                                               //減少
                                            serial.printf("\r\n---decrease---");    
                                            break;}
                                        else if(strcmp(moji,"b")==0 || strcmp(moji,"q")==0){break;}
                                        else serial.printf("\r\n\r\n NG!\r\n");
                                    }
                                    else count++;        // 文字カウンタに1加算
                                }
                        } //numモード
                        if(strcmp(moji,"b")==0 || strcmp(moji,"q")==0){break;}  //ループ4ブレイク
                            while(1){ //ループ5
                            serial.printf("\r\n Type number [0-255]. ('q' quit, 'b' back)");
                            for(int i=0; i<3; i++){moji[i] = '0';}
                            
