ryousato/LPC11U35_CTswitch_relay/main.cpp
                                while(1){ //numモード2
                                    if(serial.readable()) {    // 受信確認
                                        moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                                        serial.printf("%c", moji[count]);   //シリアル出力表示
    
                                        if(count == 4 ){                // ①文字数が既定の個数になった場合
                                            moji[4] = '\0';                 // 末尾に終端文字を入れる
                                            serial.printf("\r\n\r\n ERROR!\r\n");
                                           count = 0;                       // 文字カウンタをリセット
                                        }
                                        else if(moji[0] == '\n'){count = 0;}
                                        else if((moji[count] == '\r')) {       // ②CRを受信した場合
                                            moji[count] = '\0';                                         //末尾に終端文字を入れる
                                            count = 0;                                                  //文字カウンタをリセット
                                            if(strcmp(moji,"b")==0 || strcmp(moji,"q")==0){break;}
                                            for(int i=0; i<3; i++){suuji[i] = 0;}
                                            for(int i=0; i<3; i++){
                                                suuji[i] = moji[i];
                                                suuji[i] -= 48;
                                                }
                                            for(int i=0; i<3; i++){moji[i] = '0';}
                                            if(suuji[0]>=0&&suuji[0]<=9){
                                                if(suuji[1]>=0&&suuji[1]<=9){
                                                    if(suuji[2]>=0&&suuji[2]<=9){
                                                        suuji[0] *= 100;
                                                        suuji[1] *= 10;
                                                        }
                                                    else{
                                                        suuji[0] *= 10;
                                                        suuji[2] = 0;
                                                        }
                                                }
                                                else{
                                                    suuji[1] = 0;
                                                    suuji[2] = 0;
                                                    }
                                            }
                                            else{serial.printf("\r\n\r\n NG!\r\n"); break;}

                                            wa = suuji[0]+suuji[1]+suuji[2];
                                            
                                            incdec(incr,wa,CorF,mode);
                                            
                                        }
                                        else count++;        // 文字カウンタに1加算
                                    }
                                } //numモード2
                                if(strcmp(moji,"b")==0){
                                    serial.printf("\r\n return\r\n");
                                    break;  //ループ5ブレイク
                                }
                                else if(strcmp(moji,"q")==0){break;}
                            } //ループ5
                            if(strcmp(moji,"q")==0){break;}    //ループ5→4ブレイク
                        } //ループ4
                        if(strcmp(moji,"b")==0){
                        serial.printf("\r\n return\r\n");
                        break;  //ループ4→3ブレイク
                        }
                        else if(strcmp(moji,"q")==0){break;}    //ループ4→3ブレイク
                    } //if文
                } //ループ3
                if(strcmp(moji,"q")==0){break;}    //ループ3→2ブレイク
            } //ループ2
            if(strcmp(moji,"q")==0){
                serial.printf("\r\n quit\r\n");
                break;    //ループ2→1ブレイク
            }
        } //ループ１
        
        serial.printf("\r\n MANUAL_ADJ END");
}

/******************************************************************************/
//タイマー割込み https://monoist.atmarkit.co.jp/mn/articles/1506/19/news001_2.html
/******************************************************************************/
/*
void attime(){
    led1 = !led1;
}
*/
/******************************************************************************/
//タイマー割込み
//オフセット補正したActualVrefを求める (平均値を出しているだけ)
/******************************************************************************/
void AVrefcal(){
    led1 = !led1;
    
    if(mode_p == 1){AD_val = AD_TRANS_IN.read();}
    else if(mode_p==2 || mode_p==3){AD_val = AD_CT_IN.read();}
    
    AD_val = AD_val * Vcc;  //(val)
    AD_flag = 1;

    //serial.printf("\r\n AD_val = %f",AD_val);
}

////////////////////////////
//サンプリング ActualVref
//mode 1:TRANS 2:CT1 3:CT2
////////////////////////////
void offsetcal(int mode){
    AD_count = 0;
    AD_flag = 0;
    AD_val = 0;
    AD_val_sum = 0;

    mode_p = mode;
    if(mode == 1){coilEN2 = 0;}                     //TRANS_OUTをAD入力方向へ切替え
    else if(mode == 2){coilEN3 = 0; coilEN4 = 0;}   //CT1_OUT1と2をAD入力方向へ切替え
    else if(mode == 3){coilEN3 = 0; coilEN4 = 1;}   //CT1_OUT1と2をAD入力方向へ切替え

    wait(0.05);
    
    timerint.attach(&AVrefcal,0.020408);
    
    timecount.start();
    
    while(1){
        if(AD_count < 98 && AD_flag == 1){    //サンプリング数0~Nで、サンプル取得されたとき
            AD_count ++;
            AD_val_sum += AD_val;
            AD_flag = 0;
            if(AD_count == 0){timecount.start();} //0~Nのサンプリング時間計測用スタート時
            else if(AD_count == 98){        //0~Nのサンプリング時間計測用ストップ時
                timecount.stop();
                //serial.printf("\r\n t = %f",timecount.read());
                timecount.reset();
            }
        }
        else if(AD_count < 98 && AD_flag == 0){}    //サンプリング数0~Nで、サンプル取得されてないとき
        else{                                       //サンプリング完了時
            Vref = AD_val_sum / AD_count;
            ActualVref[mode_p] = Vref;              //格納
            serial.printf("\r\n Vref%d = %f",mode_p,ActualVref[mode_p]);
            break;
        }
    }
    timerint.detach();
    led1 = 0;
}

void dispVref(){
    serial.printf("\r\n TRANS_Vref = %f",ActualVref[1]);
    serial.printf("\r\n CT1___Vref = %f",ActualVref[2]);
    serial.printf("\r\n CT2___Vref = %f",ActualVref[3]);
}
/******************************************************************************/
//タイマー割込み
//AD変換によりVrmsを求める
/******************************************************************************/
//タイマー割込み実行関数
void timerAD(){
    led1 = !led1;
    //serial.printf("\r\n mode_p = %d",mode_p);
    //serial.printf("\r\n ActualVref = %f",ActualVref[mode_p]);
    
    if(mode_p == 1){AD_val = AD_TRANS_IN.read();}
    else if(mode_p==2 || mode_p==3){AD_val = AD_CT_IN.read();}         
    
    //serial.printf("\r\n AD_val = %f",AD_val);
    
    AD_val *= Vcc;
    AD_val -= ActualVref[mode_p];
    //serial.printf("\r\n  AD_val*Vcc-Vref = %f",AD_val);
    AD_val *= AD_val;
    AD_flag = 1;
      
    //serial.printf("\r\n AD_val = %f",AD_val);
}
////////////////////////////
//サンプリング Vrms
//mode 1:TRANS 2:CT1 3:CT2
////////////////////////////
void ADVrms(int mode){
    AD_count = 0;
    AD_flag = 0;
    AD_val = 0;
    AD_val_sum = 0;

    mode_p = mode;
    if(mode == 1){coilEN2 = 0;}                     //TRANS_OUTをAD入力方向へ切替え
    else if(mode == 2){coilEN3 = 0; coilEN4 = 0;}   //CT1_OUT1をAD入力方向へ切替え
    else if(mode == 3){coilEN3 = 0; coilEN4 = 1;}   //CT1_OUT2をAD入力方向へ切替え

    wait(0.05);
    
    timerint.attach(&timerAD,0.020408);
    
    timecount.start();
            
    while(1){
        if(AD_count < 49 && AD_flag == 1){      //サンプリング数0~Nで、サンプル取得されたとき
            AD_count ++;
            AD_val_sum += AD_val;
            AD_flag = 0;
            if(AD_count == 0){timecount.start();}   //0~Nのサンプリング時間計測用スタート時
            else if(AD_count == 49){          //0~Nのサンプリング時間計測用ストップ時
                timecount.stop();
                //serial.printf("\r\n t = %f",timecount.read());
                timecount.reset();
            }
        }
        else if(AD_count < 49 && AD_flag == 0){}//サンプリング数0~Nで、サンプル取得されてないとき
        else{                                       //サンプリング完了時
            AD_val_sum /= AD_count;
            Vrms = sqrtf(AD_val_sum);
            //serial.printf("\r\n AD_val_sum = %f",AD_val_sum);
            serial.printf("\r\n Vrms = %f",Vrms);
            break;
        }
    }
    timerint.detach();
    led1 = 0;
}

