ryousato/LPC11U35_CTswitch_relay/main.cpp
//デバッグ用
void att(int mode){
    mode_p = mode;
    timerint.attach(&timerAD,0.020408);    //サンプリング数=49  20.4ms周期
    } 
void det(){timerint.detach();}

/******************************************************************************/
//自動調整
//TRANS_OUT設定範囲 : AC 50~138V
//CT1,2_OUT設定範囲 : AC 10~120A
/******************************************************************************/
void auto_adj(int mode){

///////////////////////////////////////////////////////////////////////////////
    POTini(mode);   //POTを初期値に設定
///////////////////////////////////////////////////////////////////////////////

    //'60A' or '120A'
    if(mode == 2 || mode == 3){
        serial.printf("\r\n Select range mode. Type '60A' or '120A'.");
        while(1){
            if(serial.readable()) {    // 受信確認
                moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                serial.printf("%c", moji[count]);   //シリアル出力表示
    
                if(count == 5 ){                // ①文字数が既定の個数になった場合
                    moji[5] = '\0';                 // 末尾に終端文字を入れる
                    serial.printf("\r\n\r\n ERROR!\r\n");
                    count = 0;                       // 文字カウンタをリセット
                    }

                else if(moji[0] == '\n'){count = 0;}
    
                else if((moji[count] == '\r')) {       // ②CRを受信した場合
                    moji[count] = '\0';                                         //末尾に終端文字を入れる
                    count = 0;                                                  //文字カウンタをリセット
                    if     (strcmp(moji, "60A") == 0){
                        SCT_AMP = 0;        //CT入力アンプ 60Aレベル切替え
                        break;}
                    else if(strcmp(moji, "120A") == 0){
                        SCT_AMP = 1;        //CT入力アンプ 120Aレベル切替え
                        break;}
                    else serial.printf("\r\n\r\n NG!\r\n");
                    }
                else count++;        // 文字カウンタに1加算
            }
        }
        serial.printf("\r\n OK");
    } //'60A' or '120A'

    while(1) { //ループ1
        int adjnum = 0;
    
        //シリアル表示
        if(mode == 1) {
            serial.printf("\r\n Type number AC [50-138] V. ('q' quit)");
        } else if(mode==2 || mode==3) {
            serial.printf("\r\n Type number AC [10-120] A. ('q' quit)\r\n (If 61~120A, range mode change 120A automatically.)");
        }

        for(int i=0; i<3; i++) {
            moji[i] = '0';   //mojiを初期化
        }

        while(1) { //adjnumループ
            if(serial.readable()) {    // 受信確認
                moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
                serial.printf("%c", moji[count]);   //シリアル出力表示

                if(count == 4 ) {               // ①文字数が既定の個数になった場合
                    moji[4] = '\0';                 // 末尾に終端文字を入れる
                    serial.printf("\r\n\r\n ERROR!\r\n");
                    count = 0;                       // 文字カウンタをリセット
                } else if(moji[0] == '\n') {
                    count = 0;
                } else if((moji[count] == '\r')) {     // ②CRを受信した場合
                    moji[count] = '\0';                                         //末尾に終端文字を入れる
                    count = 0;                                                  //文字カウンタをリセット
                    if(strcmp(moji,"q")==0) {
                        break;
                    }
                    for(int i=0; i<3; i++) {
                        suuji[i] = 0;   //suujiを初期化
                    }
                    for(int i=0; i<3; i++) {
                        suuji[i] = moji[i];
                        suuji[i] -= 48;  //ASCII → 10進
                    }
                    for(int i=0; i<3; i++) {
                        moji[i] = '0';   //mojiを初期化
                    }

                    //数字であるか判定
                    if(suuji[0]>=0 && suuji[0]<=9) {
                        if(suuji[1]>=0&&suuji[1]<=9) {
                            if(suuji[2]>=0&&suuji[2]<=9) {
                                suuji[0] *= 100;
                                suuji[1] *= 10;
                            } else {
                                suuji[0] *= 10;
                                suuji[2] = 0;
                            }
                        } else {
                            suuji[1] = 0;
                            suuji[2] = 0;
                        }
                    } else {
                        serial.printf("\r\n\r\n NG!\r\n");
                        adjnum = 1;
                        break;  //adjnumループ ブレイク
                    }

                    setval = suuji[0]+suuji[1]+suuji[2];
                    
                    //設定範囲判定 と Vrms換算
                    if(mode == 1){
                        if(setval >= 50 && setval <= 138){
                            setval = setval * 0.12 * 0.196078;  //0.12:トランス比 0.196078:分圧抵抗比
                            //serial.printf("\r\n %f",setval);
                            setval /= 2;
                            setval /= sqrtf(2);
                            serial.printf("\r\n setval = %f",setval);
                            break;  //adjnumループ ブレイク
                        }
                        else{
                            serial.printf("\r\n\r\n NG!\r\n");
                            adjnum = 1;
                            break;  //adjnumループ ブレイク
                        }
                    }
                    else if(mode==2 || mode==3){
                        if(setval >= 10 && setval <= 120){
                            setval = setval / 3000 * 10 * 5.666667;  //3000:CT比 10:終端抵抗 5.666667:分圧抵抗比
                            serial.printf("\r\n setval = %f",setval);
                            if(setval >= 61 && setval <= 120){SCT_AMP = 1;}
                            break;  //adjnumループ ブレイク
                        }
                        else{
                            serial.printf("\r\n\r\n NG!\r\n");
                            adjnum = 1;
                            break;  //adjnumループ ブレイク
                        }
                    }
                } else count++;      // 文字カウンタに1加算
            } //if
        } //adjnumループ
        if(adjnum==0 || strcmp(moji,"q")==0){break;} //ループ1ブレイク
    } //ループ1

    int adjcount = 0; //ループ2上限変数
    
