ryousato/LPC11U35_CTswitch_relay/main.cpp
    while(1){ //ループ2
        if(strcmp(moji,"q")==0){
            serial.printf("\r\n quit");
            break; //ループ2ブレイク
        }
        else if(adjcount >= 15){    //ループ2上限値
            serial.printf("\r\n\r\n ERROR!\r\n");
            break; //ループ2ブレイク
        }
        
        ADVrms(mode);   //現在のVrms値
        
        diff = setval - Vrms;   //差分
        //serial.printf("\r\n diff = %f",diff);
        
        //増減方向判定
        if(diff > 0){incr = 1;} //増
        else if(diff < 0){
            incr = 0;           //減
            diff *= -1;         //絶対値
        }
        else if(diff == 0){break;}  //差分無し ループ2ブレイク
        serial.printf("\r\n diff = %f",diff);
        serial.printf("\r\n incr = %d",incr);
        
        //粗・微 調整判定
        if(diff >= 0.03){CorF = 2;} //粗
        else if(diff < 0.03){
            CorF = 1;               //微
            if(diff < 0.002){break;}//差分微小 ループ2ブレイク(通常最終ゴール)
        }
        serial.printf("\r\n CorF = %d",CorF);
        
        //調整tap値算出
        if(CorF == 2){val = diff / 0.02;}
        else if(CorF == 1){val = diff / 0.002;}
        serial.printf("\r\n tap(val) = %d",val);
        
        //ワイパー位置移動
        incdec(incr, val, CorF, mode);
        
        adjcount ++;
         
    } //ループ2
    
    if(mode==1){coilEN2 = 0;}                                //TRANS_OUTを外部出力へ切替え
    else if(mode==2 || mode==3){coilEN3 = 0; coilEN4 = 0;}   //CT1_OUT1と2を外部出力へ切替え
    
    serial.printf("\r\n ADJ END");
}

void Vswitch(int a){
    coilEN5 = a;
    serial.printf("\r\n OK");
}
void Fswitch(int a){
    coilEN1 = a;
    serial.printf("\r\n OK");
}
void Tswitch(int a){
    coilEN2 = a;
    serial.printf("\r\n OK");
}
void Cswitch(int a,int b){
    coilEN3 = a;
    coilEN4 = b;
    serial.printf("\r\n OK");
}

/******************************************************************************/
//シリアル入力受付 [メイン]
/******************************************************************************/
void serial_inout(){
    if(serial.readable()) {    // 受信確認
    moji[count] = serial.getc();        //キーボード入力文字を1文字ずつmojiに代入
    serial.printf("%c", moji[count]);   //シリアル出力表示
//    serial.printf("%c(%d)", moji[count],count);   //シリアル出力表示
        
        if(count == 31 ){                // ①文字数が既定の個数になった場合
        moji[31] = '\0';                 // 末尾に終端文字を入れる
        count = 0;                       // 文字カウンタをリセット
        serial.printf("\r\n\r\n ERROR!");
        }

        else if(moji[0] == '\n'){count = 0;}
    
        else if((moji[count] == '\r')) {       // ②CRを受信した場合
            moji[count] = '\0';                                                     //末尾に終端文字を入れる
            count = 0;                                                              //文字カウンタをリセット
            if     (strcmp(moji, "cmd") == 0){helpwrite();}                         //コマンド一覧表示
            else if(strcmp(moji, "help") == 0){helpwrite();}                        //コマンド一覧表示
            else if(strcmp(moji, "?") == 0){helpwrite();}                           //コマンド一覧表示
            else if(strcmp(moji, "initial") == 0){initial();}                       //初期化
            
            else if(strcmp(moji, "V_OFF") == 0){Vswitch(0);}                        //±5V,±15Vオフ
            else if(strcmp(moji, "V_ON") == 0){Vswitch(1);}                         //±5V,±15Vオン
            else if(strcmp(moji, "50Hz") == 0){Fswitch(0);}                         //周波数切替
            else if(strcmp(moji, "60Hz") == 0){Fswitch(1);}                         //周波数切替
            else if(strcmp(moji, "TRANS_OUT_ADINT") == 0){Tswitch(0);}              //TRANS_OUT内部AD入力
            else if(strcmp(moji, "TRANS_OUT_EXT") == 0){Tswitch(1);}                //TRANS_OUT外部出力
            else if(strcmp(moji, "CT1_OUT_ADINT") == 0){Cswitch(0,0);}              //CT1_OUT内部AD入力
            else if(strcmp(moji, "CT2_OUT_ADINT") == 0){Cswitch(0,1);}              //CT2_OUT内部AD入力
            else if(strcmp(moji, "CT_OUT_EXT") == 0){Cswitch(1,0);}                 //CT1,2_OUT外部出力
            
            else if(strcmp(moji, "TRANS_offset") == 0){offsetcal(1);}               //TRANS_OUT ADオフセット補正
            else if(strcmp(moji, "CT1_offset") == 0){offsetcal(2);}                 //CT1_OUT ADオフセット補正
            else if(strcmp(moji, "CT2_offset") == 0){offsetcal(3);}                 //CT2_OUT ADオフセット補正
            else if(strcmp(moji, "dispVref") == 0){dispVref();}                     //各Vref表示
            else if(strcmp(moji, "TRANS_ADJ") == 0){auto_adj(1);}                   //TRANS_OUT調整モードに移行
            else if(strcmp(moji, "CT1_ADJ") == 0){auto_adj(2);}                     //CT1_OUT調整モードに移行
            else if(strcmp(moji, "CT2_ADJ") == 0){auto_adj(3);}                     //CT2_OUT調整モードに移行
            else if(strcmp(moji, "MANUAL_TRANS_ADJ") == 0){manual_adj(1);}          //TRANS_OUT手動調整モードに移行
            else if(strcmp(moji, "MANUAL_CT1_ADJ") == 0){manual_adj(2);}            //CT1_OUT手動調整モードに移行
            else if(strcmp(moji, "MANUAL_CT2_ADJ") == 0){manual_adj(3);}            //CT1_OU2手動調整モードに移行
            
            //デバッグ用
            else if(strcmp(moji, "TCON") == 0){TCON();}
            else if(strcmp(moji, "TCONread") == 0){TCONread();}
            else if(strcmp(moji, "read") == 0){read();}
            else if(strcmp(moji, "write00") == 0){write00();}
            else if(strcmp(moji, "write7F") == 0){write7F();}
            else if(strcmp(moji, "writeFF") == 0){writeFF();}
            else if(strcmp(moji, "WLAT") == 0){WLAT();}
            else if(strcmp(moji, "CS0") == 0){CS(0);}
            else if(strcmp(moji, "CS1") == 0){CS(1);}
            else if(strcmp(moji, "AD1") == 0){AD(1);}
            else if(strcmp(moji, "AD2") == 0){AD(2);}
            else if(strcmp(moji, "TENinc") == 0){TENinc();}
            else if(strcmp(moji, "att1") == 0){att(1);}
            else if(strcmp(moji, "att2") == 0){att(2);}
            else if(strcmp(moji, "att3") == 0){att(3);}
            else if(strcmp(moji, "det") == 0){det();}
            else if(strcmp(moji, "AD1_Vrms") == 0){ADVrms(1);}
            else if(strcmp(moji, "AD2_Vrms") == 0){ADVrms(2);}
            else if(strcmp(moji, "AD3_Vrms") == 0){ADVrms(3);}
                   
            else serial.printf("\r\n\r\n NG!\r\n");
        }
        else count++;        // 文字カウンタに1加算
    }
}    

/******************************************************************************/
//メインプログラム
/******************************************************************************/
int main() {
    pAVrefcal = &ActualVref[0];
    pmode = &mode_p;
    
    led1 = 1;
    wait(0.2);
    setup();
    initial();
    offsetcal(1);
    offsetcal(2);
    offsetcal(3);
    led1 = 1;
    coilEN2 = 1;    //TRANS_OUT出力
    coilEN3 = 1;    //CT1,2_OUT出力
    coilEN4 = 0;
    led1 = 0;
    serialstart();
    
//*(volatile int *)0x4004402C = 0x2;  //  (レジスタ値を直接入力) アドレス0x4004402Cに値を代入
//*(volatile int *)0x4004402C;
//serial.printf( "data in 0x4004402C is 0x%08X\n", *(volatile int *)0x4004402C );  //  アドレス0x4004402Cの値を表示
  
    while(1){
        serial_inout();
    }
  

}